Revit 2027 API
BuiltInFailures.DPartFailures.DivideVolumesProfilesForWidthSome Property
 Division family cannot be used for some widths of hosts
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivideVolumesProfilesForWidthSome { get; }
Public Shared ReadOnly Property DivideVolumesProfilesForWidthSome As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivideVolumesProfilesForWidthSome {
	FailureDefinitionId^ get ();
}
static member DivideVolumesProfilesForWidthSome : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace